"""
Ми маємо таку структуру файлу:

60b90c1c13067a15887e1ae1,Tayson,3
60b90c2413067a15887e1ae2,Vika,1
60b90c2e13067a15887e1ae3,Barsik,2
60b90c3b13067a15887e1ae4,Simon,12
60b90c4613067a15887e1ae5,Tessi,5
Кожен запис складається з трьох частин і починається з нового рядка. Наприклад, для першого запису початок
 60b90c1c13067a15887e1ae1 — це первинний ключ бази даних MongoDB. Він завжди містить 12 байтів або рівно 24 символи. 
 Далі ми бачимо прізвисько кота Tayson та його вік 3. Всі частини запису розділені символом кома ,

Розробіть функцію get_cats_info(path), яка повертатиме список словників із даними котів у вигляді:

[
    {"id": "60b90c1c13067a15887e1ae1", "name": "Tayson", "age": "3"},
    {"id": "60b90c2413067a15887e1ae2", "name": "Vika", "age": "1"},
    {"id": "60b90c2e13067a15887e1ae3", "name": "Barsik", "age": "2"},
    {"id": "60b90c3b13067a15887e1ae4", "name": "Simon", "age": "12"},
    {"id": "60b90c4613067a15887e1ae5", "name": "Tessi", "age": "5"},
]

Параметри функції:
path - шлях до файлу

Вимоги:
прочитайте вміст файлу за допомогою режиму "r".
ми використовуємо менеджер контексту with
поверніть із функції список котів із файлу у потрібному форматі
"""
from pathlib import Path

def get_cats_info(path):
# -------- визначення пустих списків для заповнення і використання їх вподальшому ----------
    fin_list = [] # фінальний список, який буде збирати словники з інформацією
    key_list = ["id", "name", "age"]  # зарння підготовлений список для ключів (незмінний)
    var_list = []   # підготовлений список для запису змінних у словних
# -------- відкриття і зчитування даних з файлу ----------
    with open(path, "r") as virt_file:
        while True:
            dict_el = {}  # пустий словник (має тут бути обов'язково пустим для кожного перезапису в циклі while) - в нього далі записується із списків отримані ключі і дані зі строки
            line = virt_file.readline()
            line_strip = line.rstrip()
            var_list = line_strip.split(',')  # результуючий список з отриманими даними
            if line == "":
                break
# -------- створення словника по 2-м існуючим спискам key_list, var_list
            for i in range(0, len(key_list)):
                dict_el[key_list[i]] = var_list[i]
# --------  запис створених словників у фінальний список
            fin_list.append(dict_el)
    return  fin_list

print(get_cats_info(Path(r"E:\Py_Projects\First_project\txt_folder\Cat_file.txt")))   